# LineShapeAtCorner Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..LineShapeAtCorner Property
ParameterTypeId Class See Also
---
"Line Shape at Landing Corner"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId LineShapeAtCorner { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LineShapeAtCorner As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ LineShapeAtCorner {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace